fe32/tutorials/rheoFoam/Cavity/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingLid
    {
        type            wall;
        nFaces          127;
        startFace       32004;
    }
    fixedWalls
    {
        type            wall;
        nFaces          381;
        startFace       32131;
    }
    frontAndBack
    {
        type            empty;
        nFaces          32258;
        startFace       32512;
    }
)


// ************************************************************************* //
